emacs/.emacs.d/config.org
**** Fonts
#+NAME::org-mode-variable-width-fonts
#+BEGIN_SRC emacs-lisp
  ;; Not sure why this is needed, but the org-indent face "requires" it (pun)
  (require 'org-indent)

  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  (set-face-attribute 'org-document-title nil :font "SF Pro Display" :weight 'bold :height 1.2)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.15)
                  (org-level-3 . 1.1)
                  (org-level-4 . 1.05)
                  (org-level-5 . 1.05)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "SF Pro Display" :weight 'medium :height (cdr face)))
#+END_SRC

** Roam
*** Install package
#+NAME::org-roam-package
#+BEGIN_SRC emacs-lisp
  (use-package org-roam
      :init
        (setq org-roam-v2-ack t) ;; Turn off v2 warning
        (org-roam-setup)
      :custom
        (org-roam-directory (file-truename "~/Projects/Writing/Roam/"))
        (org-roam-dailies-directory "daily/")
        (org-roam-completion-everywhere t)
      :bind
        (("C-c r b" . org-roam-buffer-toggle)
         ("C-c r t" . org-roam-dailies-goto-today)
         ("C-c r y" . org-roam-dailies-goto-yesterday)
         ("C-c r f" . org-roam-node-find)
         ("C-M-n" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i"   . completion-at-point)))
#+END_SRC

*** Configure templates

*** Extending Roam
- Here we add additional function to org-roam to either do something specific for more workflow, or otherwise make ~org-roam~ more full featured.

**** Set CREATED and LAST_MODIFIED tags on save
I use the PROPERTIES drawer in my org-roam files to denote a few simple fields, such as as the node type. It would also be helpful to have some reliable timestamps. This code does that.

I pulled these functions from [[https://org-roam.discourse.group/t/update-a-field-last-modified-at-save/321/2s][this discourse link]] if you're so inclined to dig further. They run as a ~:hook:~ before save in ~org-mode~.

#+NAME::org-roam-set-timestamps-on-save
#+BEGIN_SRC emacs-lisp
  (defvar dl/org-created-property-name "CREATED")

  (defun dl/org-set-created-property (&optional active name)
    (interactive)
    (let* ((created (or name dl/org-created-property-name))
           (fmt (if active "<%s>" "[%s]"))
           (now (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
      (unless (org-entry-get (point) created nil)
        (org-set-property created now)
        now)))

  (defun dl/org-find-time-file-property (property &optional anywhere)
    (save-excursion
      (goto-char (point-min))
      (let ((first-heading
             (save-excursion
               (re-search-forward org-outline-regexp-bol nil t))))
        (when (re-search-forward (format "^#\\+%s:" property)
                                 (if anywhere nil first-heading) t)
          (point)))))

  (defun dl/org-has-time-file-property-p (property &optional anywhere)
    (when-let ((pos (dl/org-find-time-file-property property anywhere)))
      (save-excursion
        (goto-char pos)
        (if (and (looking-at-p " ")
                 (progn (forward-char)
                        (org-at-timestamp-p 'lax)))
            pos -1))))

  (defun dl/org-set-time-file-property (property &optional anywhere pos)
    (when-let ((pos (or pos
                        (dl/org-find-time-file-property property))))
      (save-excursion
        (goto-char pos)
        (if (looking-at-p " ")
            (forward-char)
          (insert " "))
        (delete-region (point) (line-end-position))
        (let* ((now (format-time-string "[%Y-%m-%d %a %H:%M]")))
          (insert now)))))

  (defun dl/org-set-last-modified ()
    "Update the LAST_MODIFIED file property in the preamble."
    (when (derived-mode-p 'org-mode)
      (dl/org-set-time-file-property "LAST_MODIFIED")))  
#+END_SRC

**** Quick log entry header
I map a leader key to let me quickly enter a log entry in my daily note. I prefer a just typing into a simple buffer with timestamp headers over more granular templates.

#+NAME::insert-timestamps
#+BEGIN_SRC emacs-lisp

(defvar current-time-format "%H:%M:%S"
  "Format of date to insert with `insert-current-time' func.
Note the weekly scope of the command's precision.")

(defun insert-current-time ()
  "insert the current time (1-week scope) into the current buffer."
       (interactive)
       (insert "** ")
       (insert (format-time-string current-time-format (current-time)))
       (insert "\n")
       )

 (dl/leader-keys
  ","  '(insert-current-time :which-key "current time"))

#+END_SRC

** Evil mode (Vim)
*** Install package
This is what makes emacs possible for me. All evil mode packages and related configuration.

#+NAME: evil-packages
#+BEGIN_SRC emacs-lisp 

    (defun dl/evil-hook ()
      (dolist (mode '(eshell-mode
                      git-rebase-mode
                      term-mode))
      (add-to-list 'evil-emacs-state-modes mode))) ;; no evil mode for these modes

    (use-package evil
      :init
      (setq evil-want-integration t) ;; TODO: research what this does
      (setq evil-want-keybinding nil)
      (setq evil-want-fine-undo 'fine) ;; undo/redo each motion 
      (setq evil-want-Y-yank-to-eol t) ;; Y copies to end of line like vim
      (setq evil-want-C-u-scroll t) ;; vim like scroll up
      :hook (evil-mode . dl/evil-hook)
      :config
      (evil-mode 1)

      ;; Emacs "cancel" == vim "cancel"
      (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
      ;; Ctrl-h deletes in vim insert mode
      (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
      ;; When we wrap lines, jump visually, not to the "actual" next line
      (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

      (evil-set-initial-state 'message-buffer-mode 'normal)
      (evil-set-initial-state 'dashboard-mode 'normal))

    ;; Gives me vim bindings elsewhere in emacs
    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))

    ;; Keybindings in org mode
    (use-package evil-org
      :after org
      :hook
        (org-mode . (lambda () evil-org-mode))
      :config
      (require 'evil-org-agenda)
      (evil-org-agenda-set-keys))

    ;; Branching undo system
    (use-package undo-tree
      :after evil
      :diminish 
      :config
      (evil-set-undo-system 'undo-tree)
      (global-undo-tree-mode 1))

#+END_SRC

** Utility packages
Various helpers.

*** Google
#+BEGIN_SRC emacs-lisp
  ;; You can probably guess
  (use-package google-this
    :config
    (google-this-mode 1))
#+END_SRC

** Managing projects
*** Projectile
Projectile enables me organize projects with a killer grep interface.

#+NAME: projectile
#+BEGIN_SRC emacs-lisp :var code_dir_path=(org-table-get-constant "code_dir_path")
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom
	((projectile-completion-system 'ivy))
      :bind-keymap
	("C-c p" . projectile-command-map)
      :init
	(when (file-directory-p code_dir_path)
	(setq projectile-project-search-path '(code_dir_path)))
	  (setq projectile-switch-project-action #'projectile-dired))

  ;; Gives me Ivy options in the Projectile menus
  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+END_SRC

** Managing files
Configuration related to filesystem, either basic IO and interaction from emacs or directly moving files around where it makes sense.

*** Backups and auto-save
These settings keep emacs from littering the filesystem with buffer backups. These files look like ~~yourfilename.txt~ or ~#yourfilename.txt#~ and would otherwise be dropped in your working directory.

#+NAME: backup-files
#+BEGIN_SRC emacs-lisp 
  (setq backup-directory-alist
    `(("." . ,(concat user-emacs-directory "backup")))
      backup-by-copying t    ; Don't delink hardlinks
      version-control t      ; Use version numbers on backups
      delete-old-versions t  ; Automatically delete excess backups
      kept-new-versions 20   ; how many of the newest versions to keep
      kept-old-versions 5    ; and how many of the old
    )
#+END_SRC

